
class ManyVariables {
	static int x = 9, у; // Статичні змінні — поля класа
	// Вони видимі у всіх методах і блоках класа
	// Змінна у отримує значення 0
	static{ // Блок ініціалізації статичних змінних
	// Виконується один раз при перому завантаженні класа після
	// ініціалізацій в оголошеннях змінних
	x = 99; // Оператор виконується зовні всякого метода!
	}
	int а = 1, р; // Нестатичні змінні — поля екземпляра
	// Відомі у всіх методах і блоках класа, в котрих вони
	//не перекриті другими змінними з тим же іменем
	// Змінна р отримує значення 0
	{ // Блок ініціалізації екземпляра
	// Виконується при створенні кожного екземпляра після
	// ініціалізацій при оголошеннях змінних
	р = 999; // Оператор виконується зовні всякого метода!
	}
	static void f(int b){ // Параметр метода b — локальна
	// змінна, відома тільки всередині метода
	
	int a = 2; // Це друга змінна з тим же іменем "а"
	// Вона відома тільки внутрі метода f() і
	// тут перекривє першу "а"
	int с; // Локальна змінна, відома тільки в методі f()
	//Не отримує ніякого початкового значення
	//і повинна бути визначена перед застосуванням
	{ int c = 555; // Помилка! Спроба повторного оголошення
	int х = 333; // Локальна змінна, відома тільки в цьому блоці
	}
	// Тут змінна х уже невідома
	for (int d = 0; d < 10; d++){
	// Змінна цикла d відома тількі в циклі
	int а = 4; // Помилка!
	int e = 5; // Локальна змінна, відома тільки в циклі for
	e++; // Ініціалізується при кожному виконанні цикла
	System.out.println("e = " + e) ; // Виводиться завжди "е = 6"
	}
	// Ту змінні d і е невідомі
	}
	public static void main(String[] args){
	int a = 9999; // Локальна змінна, відома тільки всередині метода main()
	f (a);
	}
	}